services/auth-service/tests/stress/auth-stress.yml
config:
  target: "http://localhost:4000"
  phases:
    - duration: 10
      arrivalRate: 5
      name: smoke
    - duration: 20
      arrivalRate: 30
      name: health-surge
    - duration: 20
      arrivalRate: 5
      name: register-login
  defaults:
    headers:
      content-type: application/json
  plugins:
    metrics-by-endpoint: {}
  processor: "./auth-processor.cjs"

scenarios:
  - name: Health under load
    flow:
      - get:
          url: "/health"

  - name: Register and login
    flow:
      - function: generateUser
      - post:
          url: "/api/auth/register"
          json:
            name: "{{ user.name }}"
            lastname: "{{ user.lastname }}"
            email: "{{ user.email }}"
            password: "{{ user.password }}"
            role: "student"
          capture:
            - json: "user.email"
              as: "registeredEmail"
          expect:
            - statusCode: 201
      - think: 0.3
      - post:
          url: "/api/auth/login"
          json:
            email: "{{ user.email }}"
            password: "{{ user.password }}"
          capture:
            - json: "token"
              as: "token"
          expect:
            - statusCode: 200